vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7061.inc
I2CMCON_OFFSET                 EQU       0x0900
I2CMSTA_OFFSET                 EQU       0x0904
I2CMRX_OFFSET                  EQU       0x0908
I2CMTX_OFFSET                  EQU       0x090C
I2CMCNT0_OFFSET                EQU       0x0910
I2CMCNT1_OFFSET                EQU       0x0914
I2CADR0_OFFSET                 EQU       0x0918
I2CADR1_OFFSET                 EQU       0x091C
I2CDIV_OFFSET                  EQU       0x0924
I2CSCON_OFFSET                 EQU       0x0928
I2CSSTA_OFFSET                 EQU       0x092C
I2CSRX_OFFSET                  EQU       0x0930
I2CSTX_OFFSET                  EQU       0x0934
I2CALT_OFFSET                  EQU       0x0938
I2CID0_OFFSET                  EQU       0x093C
I2CID1_OFFSET                  EQU       0x0940
I2CID2_OFFSET                  EQU       0x0944
I2CID3_OFFSET                  EQU       0x0948
I2CFSTA_OFFSET                 EQU       0x094C

; SERIAL PORT INTERFACE PERIPHERAL

SPIBASE                        EQU       0xFFFF0A00
SPISTA                         EQU       0xFFFF0A00
SPIRX                          EQU       0xFFFF0A04
SPITX                          EQU       0xFFFF0A08
SPIDIV                         EQU       0xFFFF0A0C
SPICON                         EQU       0xFFFF0A10
Z_SPISTA                       EQU       SPISTA    -Z_BASE
Z_SPIRX                        EQU       SPIRX     -Z_BASE
Z_SPITX                        EQU       SPITX     -Z_BASE
Z_SPIDIV                       EQU       SPIDIV    -Z_BASE
Z_SPICON                       EQU       SPICON    -Z_BASE

T_SPISTA                       EQU       SPISTA    -SPIBASE   
T_SPIRX                        EQU       SPIRX     -SPIBASE   
T_SPITX                        EQU       SPITX     -SPIBASE   
T_SPIDIV                       EQU       SPIDIV    -SPIBASE   
T_SPICON                       EQU       SPICON    -SPIBASE   

SPISTA_OFFSET                  EQU       0x0A00
SPIRX_OFFSET                   EQU       0x0A04
SPITX_OFFSET                   EQU       0x0A08
SPIDIV_OFFSET                  EQU       0x0A0C
SPICON_OFFSET                  EQU       0x0A10

; GPIO AND SERIAL PORT MUX

GPIOBASE                       EQU       0xFFFF0D00
GP0CON0                        EQU       0xFFFF0D00
GP1CON                         EQU       0xFFFF0D04
GP2CON                         EQU       0xFFFF0D08
GP0DAT                         EQU       0xFFFF0D20
GP0SET                         EQU       0xFFFF0D24
GP0CLR                         EQU       0xFFFF0D28
GP0PAR                         EQU       0xFFFF0D2C
GP1DAT                         EQU       0xFFFF0D30
GP1SET                         EQU       0xFFFF0D34
GP1CLR                         EQU       0xFFFF0D38
GP1PAR                         EQU       0xFFFF0D3C
GP2DAT                         EQU       0xFFFF0D40
GP2SET                         EQU       0xFFFF0D44
GP2CLR                         EQU       0xFFFF0D48
GP2PAR                         EQU       0xFFFF0D4C
Z_GP0CON0                      EQU       GP0CON0   -Z_BASE
Z_GP1CON                       EQU       GP1CON    -Z_BASE
Z_GP2CON                       EQU       GP2CON    -Z_BASE
Z_GP0DAT                       EQU       GP0DAT    -Z_BASE
Z_GP0SET                       EQU       GP0SET    -Z_BASE
Z_GP0CLR                       EQU       GP0CLR    -Z_BASE
Z_GP0PAR                       EQU       GP0PAR    -Z_BASE
Z_GP1DAT                       EQU       GP1DAT    -Z_BASE
Z_GP1SET                       EQU       GP1SET    -Z_BASE
Z_GP1CLR                       EQU       GP1CLR    -Z_BASE
Z_GP1PAR                       EQU       GP1PAR    -Z_BASE
Z_GP2DAT                       EQU       GP2DAT    -Z_BASE
Z_GP2SET                       EQU       GP2SET    -Z_BASE
Z_GP2CLR                       EQU       GP2CLR    -Z_BASE
Z_GP2PAR                       EQU       GP2PAR    -Z_BASE

T_GP0CON0                      EQU       GP0CON0   -GPIOBASE  
T_GP1CON                       EQU       GP1CON    -GPIOBASE  
T_GP2CON                       EQU       GP2CON    -GPIOBASE  
T_GP0DAT                       EQU       GP0DAT    -GPIOBASE  
T_GP0SET                       EQU       GP0SET    -GPIOBASE  
T_GP0CLR                       EQU       GP0CLR    -GPIOBASE  
T_GP0PAR                       EQU       GP0PAR    -GPIOBASE  
T_GP1DAT                       EQU       GP1DAT    -GPIOBASE  
T_GP1SET                       EQU       GP1SET    -GPIOBASE  
T_GP1CLR                       EQU       GP1CLR    -GPIOBASE  
T_GP1PAR                       EQU       GP1PAR    -GPIOBASE  
T_GP2DAT                       EQU       GP2DAT    -GPIOBASE  
T_GP2SET                       EQU       GP2SET    -GPIOBASE  
T_GP2CLR                       EQU       GP2CLR    -GPIOBASE  
T_GP2PAR                       EQU       GP2PAR    -GPIOBASE  

GP0CON0_OFFSET                 EQU       0x0D00
GP1CON_OFFSET                  EQU       0x0D04
GP2CON_OFFSET                  EQU       0x0D08
GP0DAT_OFFSET                  EQU       0x0D20
GP0SET_OFFSET                  EQU       0x0D24
GP0CLR_OFFSET                  EQU       0x0D28
GP0PAR_OFFSET                  EQU       0x0D2C
GP1DAT_OFFSET                  EQU       0x0D30
GP1SET_OFFSET                  EQU       0x0D34
GP1CLR_OFFSET                  EQU       0x0D38
GP1PAR_OFFSET                  EQU       0x0D3C
GP2DAT_OFFSET                  EQU       0x0D40
GP2SET_OFFSET                  EQU       0x0D44
GP2CLR_OFFSET                  EQU       0x0D48
GP2PAR_OFFSET                  EQU       0x0D4C

; FLASH CONTROL INTERFACE

FLASHBASE                      EQU       0xFFFF0E00
FEESTA                         EQU       0xFFFF0E00
FEEMOD                         EQU       0xFFFF0E04
FEECON                         EQU       0xFFFF0E08
FEEDAT                         EQU       0xFFFF0E0C
FEEADR                         EQU       0xFFFF0E10
FEESIG                         EQU       0xFFFF0E18
#if           ALLOW_DEPRECATED_NAMES        
; "FEESIGN" has been deprecated. Use "FEESIG" instead.
FEESIGN                        EQU       0xFFFF0E18
#endif
FEEPRO                         EQU       0xFFFF0E1C
FEEHID                         EQU       0xFFFF0E20
#if           ALLOW_DEPRECATED_NAMES        
; "FEEHIDE" has been deprecated. Use "FEEHID" instead.
FEEHIDE                        EQU       0xFFFF0E20
#endif
Z_FEESTA                       EQU       FEESTA    -Z_BASE
Z_FEEMOD                       EQU       FEEMOD    -Z_BASE
Z_FEECON                       EQU       FEECON    -Z_BASE
Z_FEEDAT                       EQU       FEEDAT    -Z_BASE
Z_FEEADR                       EQU       FEEADR    -Z_BASE
Z_FEESIG                       EQU       FEESIG    -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_FEESIGN" has been deprecated. Use "Z_FEESIG" instead.
Z_FEESIGN                      EQU       FEESIG    -Z_BASE
#endif
Z_FEEPRO                       EQU       FEEPRO    -Z_BASE
Z_FEEHID                       EQU       FEEHID    -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_FEEHIDE" has been deprecated. Use "Z_FEEHID" instead.
Z_FEEHIDE                      EQU       FEEHID    -Z_BASE
#endif

T_FEESTA                       EQU       FEESTA    -FLASHBASE 
T_FEEMOD                       EQU       FEEMOD    -FLASHBASE 
T_FEECON                       EQU       FEECON    -FLASHBASE 
T_FEEDAT                       EQU       FEEDAT    -FLASHBASE 
T_FEEADR                       EQU       FEEADR    -FLASHBASE 
T_FEESIG                       EQU       FEESIG    -FLASHBASE 
#if           ALLOW_DEPRECATED_NAMES        
; "T_FEESIGN" has been deprecated. Use "T_FEESIG" instead.
T_FEESIGN                      EQU       FEESIG    -FLASHBASE 
#endif
T_FEEPRO                       EQU       FEEPRO    -FLASHBASE 
T_FEEHID                       EQU       FEEHID    -FLASHBASE 
#if           ALLOW_DEPRECATED_NAMES        
; "T_FEEHIDE" has been deprecated. Use "T_FEEHID" instead.
T_FEEHIDE                      EQU       FEEHID    -FLASHBASE 
#endif

FEESTA_OFFSET                  EQU       0x0E00
FEEMOD_OFFSET                  EQU       0x0E04
FEECON_OFFSET                  EQU       0x0E08
FEEDAT_OFFSET                  EQU       0x0E0C
FEEADR_OFFSET                  EQU       0x0E10
FEESIG_OFFSET                  EQU       0x0E18
#if           ALLOW_DEPRECATED_NAMES        
; "FEESIGN_OFFSET" has been deprecated. Use "FEESIG_OFFSET" instead.
FEESIGN_OFFSET                 EQU       0xFFFF0E18
#endif
FEEPRO_OFFSET                  EQU       0x0E1C
FEEHID_OFFSET                  EQU       0x0E20
#if           ALLOW_DEPRECATED_NAMES        
; "FEEHIDE_OFFSET" has been deprecated. Use "FEEHID_OFFSET" instead.
FEEHIDE_OFFSET                 EQU       0xFFFF0E20
#endif

; PWM

PWMBASE                        EQU       0xFFFF0F80
PWMCON                         EQU       0xFFFF0F80
PWM0COM0                       EQU       0xFFFF0F84
PWM0COM1                       EQU       0xFFFF0F88
PWM0COM2                       EQU       0xFFFF0F8C
PWM0LEN                        EQU       0xFFFF0F90
PWM1COM0                       EQU       0xFFFF0F94
PWM1COM1                       EQU       0xFFFF0F98
PWM1COM2                       EQU       0xFFFF0F9C
PWM1LEN                        EQU       0xFFFF0FA0
PWM2COM0                       EQU       0xFFFF0FA4
PWM2COM1                       EQU       0xFFFF0FA8
PWM2COM2                       EQU       0xFFFF0FAC
PWM2LEN                        EQU       0xFFFF0FB0
PWMCLRI                        EQU       0xFFFF0FB8
Z_PWMCON                       EQU       PWMCON    -Z_BASE
Z_PWM0COM0                     EQU       PWM0COM0  -Z_BASE
Z_PWM0COM1                     EQU       PWM0COM1  -Z_BASE
Z_PWM0COM2                     EQU       PWM0COM2  -Z_BASE
Z_PWM0LEN                      EQU       PWM0LEN   -Z_BASE
Z_PWM1COM0                     EQU       PWM1COM0  -Z_BASE
Z_PWM1COM1                     EQU       PWM1COM1  -Z_BASE
Z_PWM1COM2                     EQU       PWM1COM2  -Z_BASE
Z_PWM1LEN                      EQU       PWM1LEN   -Z_BASE
Z_PWM2COM0                     EQU       PWM2COM0  -Z_BASE
Z_PWM2COM1                     EQU       PWM2COM1  -Z_BASE
Z_PWM2COM2                     EQU       PWM2COM2  -Z_BASE
Z_PWM2LEN                      EQU       PWM2LEN   -Z_BASE
Z_PWMCLRI                      EQU       PWMCLRI   -Z_BASE

T_PWMCON                       EQU       PWMCON    -PWMBASE   
T_PWM0COM0                     EQU       PWM0COM0  -PWMBASE   
T_PWM0COM1                     EQU       PWM0COM1  -PWMBASE   
T_PWM0COM2                     EQU       PWM0COM2  -PWMBASE   
T_PWM0LEN                      EQU       PWM0LEN   -PWMBASE   
T_PWM1COM0                     EQU       PWM1COM0  -PWMBASE   
T_PWM1COM1                     EQU       PWM1COM1  -PWMBASE   
T_PWM1COM2                     EQU       PWM1COM2  -PWMBASE   
T_PWM1LEN                      EQU       PWM1LEN   -PWMBASE   
T_PWM2COM0                     EQU       PWM2COM0  -PWMBASE   
T_PWM2COM1                     EQU       PWM2COM1  -PWMBASE   
T_PWM2COM2                     EQU       PWM2COM2  -PWMBASE   
T_PWM2LEN                      EQU       PWM2LEN   -PWMBASE   
T_PWMCLRI                      EQU       PWMCLRI   -PWMBASE   

PWMCON_OFFSET                  EQU       0x0F80
PWM0COM0_OFFSET                EQU       0x0F84
PWM0COM1_OFFSET                EQU       0x0F88
PWM0COM2_OFFSET                EQU       0x0F8C
PWM0LEN_OFFSET                 EQU       0x0F90
PWM1COM0_OFFSET                EQU       0x0F94
PWM1COM1_OFFSET                EQU       0x0F98
PWM1COM2_OFFSET                EQU       0x0F9C
PWM1LEN_OFFSET                 EQU       0x0FA0
PWM2COM0_OFFSET                EQU       0x0FA4
PWM2COM1_OFFSET                EQU       0x0FA8
PWM2COM2_OFFSET                EQU       0x0FAC
PWM2LEN_OFFSET                 EQU       0x0FB0
PWMCLRI_OFFSET                 EQU       0x0FB8
